Revit 2024 API
BuiltInFailures.KeyBasedTreeFileFailures Class
 Failures occurred when reading key based tree text file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class KeyBasedTreeFileFailures
Visual Basic
Public NotInheritable Class KeyBasedTreeFileFailures
Visual C++
public ref class KeyBasedTreeFileFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeFileFailures
See Also
BuiltInFailures.KeyBasedTreeFileFailures Members
Autodesk.Revit.DB Namespace